---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotPositiveBendRadius
source: html/be1d3bdf-58c9-a978-5e87-119ca6f2239e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotPositiveBendRadius Property

The value you entered for the bend radius is zero or a negative value. Enter a positive value.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotPositiveBendRadius { get; }
```